In [3]:
import pandas as pd
import numpy as np

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan,
'avocado'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0] = None

In [9]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [10]:
string_data.isna()

0     True
1    False
2     True
3    False
dtype: bool

In [11]:
from numpy import nan as NA

In [12]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [13]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
[NA, NA, NA], [NA, 6.5, 3.]])

In [16]:
cleaned = data.dropna()

In [17]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [19]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [20]:
data[4] = NA

In [21]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [22]:
data.dropna(how='all',axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
df = pd.DataFrame(np.random.randn(7, 3))

In [24]:
df.iloc[:4,1] = NA

In [25]:
df.iloc[:2,2]=NA

In [26]:
df

          0         1         2
0  0.373700       NaN       NaN
1  0.432196       NaN       NaN
2 -1.556032       NaN  0.292033
3 -0.413942       NaN -2.587828
4 -0.369536 -0.032332 -0.439448
5 -1.188223 -0.320897  1.012738
6 -1.378413 -0.952038  0.197860

In [27]:
df.dropna()

          0         1         2
4 -0.369536 -0.032332 -0.439448
5 -1.188223 -0.320897  1.012738
6 -1.378413 -0.952038  0.197860

In [28]:
df.dropna(thresh=2)

          0         1         2
2 -1.556032       NaN  0.292033
3 -0.413942       NaN -2.587828
4 -0.369536 -0.032332 -0.439448
5 -1.188223 -0.320897  1.012738
6 -1.378413 -0.952038  0.197860

In [29]:
df.fillna(0)

          0         1         2
0  0.373700  0.000000  0.000000
1  0.432196  0.000000  0.000000
2 -1.556032  0.000000  0.292033
3 -0.413942  0.000000 -2.587828
4 -0.369536 -0.032332 -0.439448
5 -1.188223 -0.320897  1.012738
6 -1.378413 -0.952038  0.197860

In [30]:
df.fillna({1:0.5,2:0})

          0         1         2
0  0.373700  0.500000  0.000000
1  0.432196  0.500000  0.000000
2 -1.556032  0.500000  0.292033
3 -0.413942  0.500000 -2.587828
4 -0.369536 -0.032332 -0.439448
5 -1.188223 -0.320897  1.012738
6 -1.378413 -0.952038  0.197860

In [31]:
df.fillna(0,inplace=True)

In [32]:
df

          0         1         2
0  0.373700  0.000000  0.000000
1  0.432196  0.000000  0.000000
2 -1.556032  0.000000  0.292033
3 -0.413942  0.000000 -2.587828
4 -0.369536 -0.032332 -0.439448
5 -1.188223 -0.320897  1.012738
6 -1.378413 -0.952038  0.197860

In [38]:
df = pd.DataFrame(np.random.randn(6, 3))

In [39]:
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA

In [40]:
df

          0         1         2
0 -0.573157  0.584832  0.539207
1  0.229308 -0.565389 -1.471956
2 -1.858956       NaN  0.061559
3 -0.949705       NaN  0.153335
4  0.093639       NaN       NaN
5 -0.756428       NaN       NaN

In [43]:
df.fillna(method='ffill')

          0         1         2
0 -0.573157  0.584832  0.539207
1  0.229308 -0.565389 -1.471956
2 -1.858956 -0.565389  0.061559
3 -0.949705 -0.565389  0.153335
4  0.093639 -0.565389  0.153335
5 -0.756428 -0.565389  0.153335

In [44]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.573157  0.584832  0.539207
1  0.229308 -0.565389 -1.471956
2 -1.858956 -0.565389  0.061559
3 -0.949705 -0.565389  0.153335
4  0.093639       NaN  0.153335
5 -0.756428       NaN  0.153335

In [46]:
df

          0         1         2
0 -0.573157  0.584832  0.539207
1  0.229308 -0.565389 -1.471956
2 -1.858956       NaN  0.061559
3 -0.949705       NaN  0.153335
4  0.093639       NaN       NaN
5 -0.756428       NaN       NaN

In [49]:
df.iloc[[0,2,4],0]=NA

In [50]:
df

          0         1         2
0       NaN  0.584832  0.539207
1  0.229308 -0.565389 -1.471956
2       NaN       NaN  0.061559
3 -0.949705       NaN  0.153335
4       NaN       NaN       NaN
5 -0.756428       NaN       NaN

In [51]:
df.fillna(method='bfill',limit=2)

          0         1         2
0  0.229308  0.584832  0.539207
1  0.229308 -0.565389 -1.471956
2 -0.949705       NaN  0.061559
3 -0.949705       NaN  0.153335
4 -0.756428       NaN       NaN
5 -0.756428       NaN       NaN

In [52]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [53]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [54]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
'k2': [1, 1, 2, 3, 3, 4, 4]})

In [55]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [56]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [57]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [58]:
data['v1']=range(7)

In [59]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [60]:
data.drop_duplicates(['k1','ke'],keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

In [61]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork',
'bacon', 'Pastrami', 'corned beef',
'Bacon','pastrami', 'honey ham', 'novalox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5,
6]})

In [62]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8      novalox     6.0

In [63]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [66]:
lowercased = data['food'].str.lower()

In [67]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8        novalox
Name: food, dtype: object

In [68]:
data['animal'] = lowercased.map(meat_to_animal)

In [69]:
data

          food  ounces animal
0        bacon     4.0    pig
1  pulled pork     3.0    pig
2        bacon    12.0    pig
3     Pastrami     6.0    cow
4  corned beef     7.5    cow
5        Bacon     8.0    pig
6     pastrami     3.0    cow
7    honey ham     5.0    pig
8      novalox     6.0    NaN

In [72]:
data['food'].map(lambda x:meat_to_animal.get(x.lower()))

0     pig
1     pig
2     pig
3     cow
4     cow
5     pig
6     cow
7     pig
8    None
Name: food, dtype: object

In [73]:
 data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [74]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [75]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [76]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [77]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [78]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [79]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [80]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [82]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [83]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [84]:
data.index = data.index.map(transform)

In [85]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [86]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [87]:
data.rename(index={'OHIO': 'INDIANA'},
columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [88]:
data.rename(index={'OHIO': 'INDIANA'},inplace=True)

In [89]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [90]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [91]:
bins = [18,25,35,60,100]

In [92]:
cats = pd.cut(ages,bins)

In [93]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [94]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [95]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [96]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [98]:
pd.cut(ages,bins,right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [99]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged',
'Senior']

In [100]:
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [101]:
 data = np.random.rand(20)

In [104]:
x = pd.cut(data,4,precision=2)

In [105]:
x.codes

array([3, 2, 3, 2, 2, 0, 3, 2, 2, 1, 3, 2, 0, 1, 2, 0, 1, 0, 2, 2],
      dtype=int8)

In [106]:
data = np.random.randn(10000)

In [107]:
cats = pd.qcut(data,4)

In [108]:
cats

[(0.669, 3.547], (0.669, 3.547], (-0.0195, 0.669], (0.669, 3.547], (-0.0195, 0.669], ..., (-0.666, -0.0195], (0.669, 3.547], (-0.0195, 0.669], (0.669, 3.547], (-3.496, -0.666]]
Length: 10000
Categories (4, interval[float64]): [(-3.496, -0.666] < (-0.666, -0.0195] < (-0.0195, 0.669] < (0.669, 3.547]]

In [109]:
cats.codes

array([3, 3, 2, ..., 2, 3, 0], dtype=int8)

In [111]:
pd.qcut(data,[0,0.1,0.5,0.9,1])

[(-0.0195, 1.279], (-0.0195, 1.279], (-0.0195, 1.279], (1.279, 3.547], (-0.0195, 1.279], ..., (-1.27, -0.0195], (-0.0195, 1.279], (-0.0195, 1.279], (1.279, 3.547], (-3.496, -1.27]]
Length: 10000
Categories (4, interval[float64]): [(-3.496, -1.27] < (-1.27, -0.0195] < (-0.0195, 1.279] < (1.279, 3.547]]

In [112]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [113]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.014088     0.044879     0.012704     0.019111
std       0.998851     1.032609     0.990244     0.990455
min      -3.250004    -3.204226    -3.383971    -3.669756
25%      -0.676378    -0.654276    -0.633891    -0.630264
50%       0.010582     0.029871     0.045899     0.031800
75%       0.718832     0.775190     0.682427     0.683103
max       2.967592     3.201108     3.179235     3.304249

In [114]:
col = data[2]

In [115]:
col[np.abs(col) > 3]

69     3.179235
605   -3.383971
842   -3.103321
Name: 2, dtype: float64

In [117]:
(np.abs(data) > 3).any(1)

0      False
1      False
2      False
3      False
4      False
5      False
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29     False
       ...
970    False
971    False
972    False
973    False
974    False
975    False
976    False
977    False
978    False
979    False
980    False
981    False
982    False
983    False
984    False
985    False
986    False
987    False
988    False
989    False
990    False
991    False
992    False
993    False
994    False
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [118]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
69   0.192253 -0.771306  3.179235  1.245443
193 -3.250004  2.187691  0.137333  0.255530
194  0.799843 -3.204226 -1.581925  0.111223
408  2.335471  3.201108  0.977130  0.568881
439 -1.102455 -0.159458  0.539116 -3.669756
605 -0.311583  1.873581 -3.383971  0.136539
637 -1.005551 -1.968761 -0.070300  3.304249
683 -3.041002  0.197038 -0.306496  0.511730
842 -1.435466 -0.567978 -3.103321  0.489095
874 -0.487800  3.038628 -0.365354 -1.011891

In [121]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [122]:
data

            0         1         2         3
0   -0.855612 -1.873496 -0.328769  1.431192
1   -0.145789 -1.391979  0.327079 -0.297668
2    0.981910  0.409722 -0.796298 -1.664883
3   -0.209107 -0.046424  2.203795 -0.077279
4    0.500225  1.108086  0.222049 -0.908929
5   -0.271726  2.556987 -0.392232  0.490252
6    0.894190  1.398927  2.207773  0.769349
7    0.409636 -0.001920 -0.526280 -0.400915
8    1.824348  0.534907  1.763939  1.145683
9    0.433067 -0.056762  0.537216 -0.301258
10  -0.538874 -2.093282 -0.661805  0.714771
11  -0.648217 -0.819901  0.302638 -0.145686
12   0.467611 -1.117940 -1.304225  0.095917
13  -0.225589  1.414735 -1.478026 -0.765367
14  -0.526791 -0.376723  1.325491 -1.876919
15   1.046750  1.523546  1.762532  0.801026
16   0.269265  0.668713 -0.183102  1.638713
17   1.436775  0.064479 -0.180747 -0.419287
18  -1.271364  1.367800 -2.287862  0.692681
19  -1.754561  0.585846 -1.422578  0.482247
20  -0.163220  0.242845 -0.459634  1.166831
21  -0.326352 -0.552261  1.577999 -1.030649
22   0.527647 -0.256883  2.481162  1.400185
23   0.778944  1.060194 -0.633276  0.207367
24  -1.153750 -0.206104 -0.715907  0.102712
25  -2.497960  0.544564 -0.282403  1.603008
26   0.356765 -0.371849 -0.518280 -0.607885
27   0.825652  1.151346 -0.771842 -0.269816
28   1.448976  1.541851  1.120330 -0.107498
29   0.989234 -0.116230  0.103248  2.268067
..        ...       ...       ...       ...
970  1.053996 -0.124016  0.063191  0.539123
971 -0.663498  0.544850 -0.473658 -0.879064
972 -1.997898  0.438195 -0.447948 -0.126506
973 -1.147925  0.156140  0.282934  0.169097
974  0.965644  0.968158  1.131229  0.132415
975 -0.037674 -1.417766 -0.193008  0.020423
976 -0.073458 -0.935485  0.124662  0.046538
977 -0.120491  1.071408 -0.495891  1.163216
978 -2.367914 -0.277377  0.676934 -1.128340
979  0.012600  0.236476  0.872348 -0.148597
980 -1.469882  0.907220  0.380021  0.228304
981  0.072482  0.999030  0.289420  0.158268
982 -1.002964  2.148323  0.113512  0.509437
983 -0.575671  0.618429 -0.541024  0.146281
984  0.727424 -0.591924  1.555610  0.092747
985  1.577296 -1.731945  1.304014 -0.520830
986  0.757204 -0.178183  1.064479 -0.169790
987 -0.867229 -0.606566  0.723514  1.846156
988  0.105629  0.707825 -0.471551 -0.254978
989  0.359504  0.989656  0.715510 -0.533060
990 -0.198908  1.520921  0.401659 -0.326264
991  1.794459 -1.074175  0.529878  0.724998
992  0.289731  1.153348  0.384617  0.881204
993  2.235998  0.755857 -0.867500  0.883333
994 -0.119878  0.890375  1.648883  1.209443
995  0.882004 -2.146399 -0.051622  0.376877
996 -1.140487  0.412113 -0.481063 -0.609598
997 -0.576362 -0.687850 -0.610322 -1.216176
998  2.050514  0.039206 -0.073934  0.740248
999 -0.037637 -1.222776 -0.509968  0.428272

[1000 rows x 4 columns]

In [123]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.014379     0.044843     0.013012     0.019477
std       0.997939     1.031278     0.988120     0.987216
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.676378    -0.654276    -0.633891    -0.630264
50%       0.010582     0.029871     0.045899     0.031800
75%       0.718832     0.775190     0.682427     0.683103
max       2.967592     3.000000     3.000000     3.000000

In [125]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1 -1.0 -1.0  1.0 -1.0
2  1.0  1.0 -1.0 -1.0
3 -1.0 -1.0  1.0 -1.0
4  1.0  1.0  1.0 -1.0

In [126]:
 df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [127]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [138]:
sampler = np.random.permutation(3)

In [139]:
sampler

array([1, 0, 2])

In [140]:
df.take(sampler)

   0  1   2   3
1  4  5   6   7
0  0  1   2   3
2  8  9  10  11

In [141]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
3  12  13  14  15

In [142]:
 choices = pd.Series([5, 7, -1, 6, 4])

In [143]:
draws = choices.sample(n=10,replace=True)

In [144]:
draws

1    7
3    6
4    4
0    5
0    5
4    4
0    5
1    7
3    6
1    7
dtype: int64

In [3]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
'data1': range(6)})

In [4]:
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [5]:
pd.get_dummies(df.key)

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [6]:
dummier = pd.get_dummies(df.key,prefix='key')

In [7]:
dummier

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [9]:
df[['data1']].join(dummier)

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [10]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [11]:
pieces = [x.strip() for x in val.split(',')]

In [12]:
pieces

['a', 'b', 'guido']

In [13]:
first, second, third = pieces

In [15]:
'::'.join(pieces)

'a::b::guido'

In [16]:
val.casefold()

'a,b, guido'

In [17]:
val.capitalize()

'A,b, guido'

In [18]:
import re
text = "foo bar\t baz \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [19]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [20]:
regex.findall(text)

[' ', '\t ', ' \t']

In [21]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [22]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [23]:
m=regex.search(text)

In [24]:
m

In [27]:
text[m.start():m.end()]

'dave@google.com'

In [28]:
m.group(0)

'dave@google.com'

In [29]:
print(regex.match(text))

None

In [30]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [31]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [32]:
m = regex.match('wesm@bright.net')

In [33]:
m.groups()

('wesm', 'bright', 'net')

In [34]:
 regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [35]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',
text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [36]:
data = {'Dave': 'dave@google.com', 'Steve':
'steve@gmail.com',
'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [37]:
data = pd.Series(data)

In [38]:
data

Dave     dave@google.com
Rob        rob@gmail.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

In [39]:
data.isnull()

Dave     False
Rob      False
Steve    False
Wes       True
dtype: bool

In [40]:
data.str.contains('gmail')

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object

In [41]:
data.str.replace('gmail','email')

Dave     dave@google.com
Rob        rob@email.com
Steve    steve@email.com
Wes                  NaN
dtype: object

In [42]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [53]:
a = data.str.findall(pattern,flags=re.IGNORECASE)

In [46]:
matches = data.str.match(pattern,flags=re.IGNORECASE)

In [54]:
a

Dave     [(dave, google, com)]
Rob        [(rob, gmail, com)]
Steve    [(steve, gmail, com)]
Wes                        NaN
dtype: object

In [64]:
a.str.get(0).str.get(0)

Dave      dave
Rob        rob
Steve    steve
Wes        NaN
dtype: object

In [47]:
matches

Dave     True
Rob      True
Steve    True
Wes       NaN
dtype: object

In [48]:
data

Dave     dave@google.com
Rob        rob@gmail.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

In [49]:
matches.str.get(1)

Dave    NaN
Rob     NaN
Steve   NaN
Wes     NaN
dtype: float64

In [50]:
data.str[0]

Dave       d
Rob        r
Steve      s
Wes      NaN
dtype: object

In [69]:
data.str.extract(pattern,flags=re.IGNORECASE,expand=False)

           0       1    2
Dave    dave  google  com
Rob      rob   gmail  com
Steve  steve   gmail  com
Wes      NaN     NaN  NaN